; ModuleID = './cilkbench/test-double.cpp'
source_filename = "./cilkbench/test-double.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.__cilkrts_worker = type { %struct.__cilkrts_stack_frame**, %struct.__cilkrts_stack_frame**, %struct.__cilkrts_stack_frame**, i32, %struct.__cilkrts_stack_frame*, %struct.cilkred_map*, %struct.global_state*, %struct.local_state*, i8*, i8*, %struct.__cilkrts_stack_frame**, [936 x i8] }
%struct.__cilkrts_stack_frame = type { i32, i32, %struct.__cilkrts_stack_frame*, %struct.__cilkrts_worker*, [5 x i8*], i8* }
%struct.cilkred_map = type { i32, i32, i32, i8, i32*, %struct.view_info* }
%struct.view_info = type { i8*, %struct.hyperobject_base* }
%struct.hyperobject_base = type { void (i8*)*, void (i8*, i8*)*, i64, i32, i32, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__cilkrts_stack_frame_align", scope: !2, file: !59, line: 27, type: !60, isLocal: false, isDefinition: true, align: 64)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 14.0.6 (/afs/ece/project/seth_group/pakha/my-opencilk-repo/clang 66ec935125d4aaf233119ec6307dd919f87c6606)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !24, globals: !50, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/afs/ece.cmu.edu/project/seth_group/pakha/opencilk/cheetah/runtime/cilk2c_inlined.c", directory: "/afs/ece.cmu.edu/project/seth_group/pakha/opencilk/cheetah/build/runtime", checksumkind: CSK_MD5, checksum: "465ec9728848294a2db321353b33b797")
!4 = !{!5, !15}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ClosureStatus", file: !6, line: 12, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "runtime/closure-type.h", directory: "/afs/ece.cmu.edu/project/seth_group/pakha/opencilk/cheetah", checksumkind: CSK_MD5, checksum: "ad13b672d768bf2ee2b89852e1537aaa")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14}
!9 = !DIEnumerator(name: "CLOSURE_RUNNING", value: 42)
!10 = !DIEnumerator(name: "CLOSURE_SUSPENDED", value: 43)
!11 = !DIEnumerator(name: "CLOSURE_RETURNING", value: 44)
!12 = !DIEnumerator(name: "CLOSURE_READY", value: 45)
!13 = !DIEnumerator(name: "CLOSURE_PRE_INVALID", value: 46)
!14 = !DIEnumerator(name: "CLOSURE_POST_INVALID", value: 47)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "memory_order", file: !16, line: 56, baseType: !7, size: 32, elements: !17)
!16 = !DIFile(filename: "my-opencilk-repo/build/lib/clang/14.0.6/include/stdatomic.h", directory: "/afs/ece.cmu.edu/project/seth_group/pakha", checksumkind: CSK_MD5, checksum: "de5d66a1ef2f5448cc1919ff39db92bc")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "memory_order_relaxed", value: 0)
!19 = !DIEnumerator(name: "memory_order_consume", value: 1)
!20 = !DIEnumerator(name: "memory_order_acquire", value: 2)
!21 = !DIEnumerator(name: "memory_order_release", value: 3)
!22 = !DIEnumerator(name: "memory_order_acq_rel", value: 4)
!23 = !DIEnumerator(name: "memory_order_seq_cst", value: 5)
!24 = !{!25, !46, !47}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pedigree_frame", file: !27, line: 18, baseType: !28)
!27 = !DIFile(filename: "runtime/pedigree-internal.h", directory: "/afs/ece.cmu.edu/project/seth_group/pakha/opencilk/cheetah", checksumkind: CSK_MD5, checksum: "b2ab48c2f7e79275c089bcca27405d96")
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pedigree_frame", file: !27, line: 13, size: 320, elements: !29)
!29 = !{!30, !41, !44, !45}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "pedigree", scope: !28, file: !27, line: 14, baseType: !31, size: 128)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__cilkrts_pedigree", file: !32, line: 24, baseType: !33)
!32 = !DIFile(filename: "runtime/../include/cilk/cilk_api.h", directory: "/afs/ece.cmu.edu/project/seth_group/pakha/opencilk/cheetah", checksumkind: CSK_MD5, checksum: "d63e31ca84b62efaf274f795284c432d")
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__cilkrts_pedigree", file: !32, line: 21, size: 128, elements: !34)
!34 = !{!35, !39}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !33, file: !32, line: 22, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !37, line: 55, baseType: !38)
!37 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "eed4343443893ce688927c5a48744974")
!38 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !33, file: !32, line: 23, baseType: !40, size: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !28, file: !27, line: 15, baseType: !42, size: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !37, line: 40, baseType: !43)
!43 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "dprng_dotproduct", scope: !28, file: !27, line: 16, baseType: !36, size: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "dprng_depth", scope: !28, file: !27, line: 17, baseType: !42, size: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !37, line: 48, baseType: !49)
!49 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!50 = !{!0, !51, !56}
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression(DW_OP_constu, 25942344, DW_OP_stack_value))
!52 = distinct !DIGlobalVariable(name: "frame_magic", scope: !2, file: !53, line: 82, type: !54, isLocal: true, isDefinition: true)
!53 = !DIFile(filename: "runtime/frame.h", directory: "/afs/ece.cmu.edu/project/seth_group/pakha/opencilk/cheetah", checksumkind: CSK_MD5, checksum: "52b672b45f7b049781032aac95098f71")
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !37, line: 51, baseType: !7)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression(DW_OP_constu, 18446744073709551557, DW_OP_stack_value))
!57 = distinct !DIGlobalVariable(name: "DPRNG_PRIME", scope: !2, file: !27, line: 9, type: !58, isLocal: true, isDefinition: true)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!59 = !DIFile(filename: "runtime/cilk2c_inlined.c", directory: "/afs/ece.cmu.edu/project/seth_group/pakha/opencilk/cheetah", checksumkind: CSK_MD5, checksum: "465ec9728848294a2db321353b33b797")
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !61, line: 46, baseType: !38)
!61 = !DIFile(filename: "my-opencilk-repo/build/lib/clang/14.0.6/include/stddef.h", directory: "/afs/ece.cmu.edu/project/seth_group/pakha", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!62 = !{i32 1, !"wchar_size", i32 4}
!63 = !{i32 7, !"uwtable", i32 1}
!64 = !{i32 7, !"frame-pointer", i32 2}
!65 = !{i32 7, !"Dwarf Version", i32 5}
!66 = !{i32 2, !"Debug Info Version", i32 3}
!67 = !{!"clang version 14.0.6 (/afs/ece/project/seth_group/ziqiliu/uli-opencilk-project/clang a3c5ebae5d3682f08ee5fffc20678b8b69c3ae06)"}
!68 = !{!"clang version 14.0.6 (/afs/ece/project/seth_group/pakha/my-opencilk-repo/clang 66ec935125d4aaf233119ec6307dd919f87c6606)"}
!69 = !DILocalVariable(name: "sf", arg: 1, scope: !70, file: !59, line: 65, type: !73)
!70 = distinct !DISubprogram(name: "__cilkrts_enter_frame", scope: !59, file: !59, line: 65, type: !71, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !427)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !73}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__cilkrts_stack_frame", file: !75, line: 9, baseType: !76)
!75 = !DIFile(filename: "runtime/types.h", directory: "/afs/ece.cmu.edu/project/seth_group/pakha/opencilk/cheetah", checksumkind: CSK_MD5, checksum: "2f05ff4e6e29b4b6ae8e6fdd175d312c")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__cilkrts_stack_frame", file: !53, line: 17, size: 576, elements: !77)
!77 = !{!78, !79, !80, !82, !425, !426}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !76, file: !53, line: 20, baseType: !55, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !76, file: !53, line: 23, baseType: !55, size: 32, offset: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "call_parent", scope: !76, file: !53, line: 28, baseType: !81, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !76, file: !53, line: 38, baseType: !83, size: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_atomic_type, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__cilkrts_worker", file: !86, line: 17, size: 8192, align: 8192, elements: !87)
!86 = !DIFile(filename: "runtime/worker.h", directory: "/afs/ece.cmu.edu/project/seth_group/pakha/opencilk/cheetah", checksumkind: CSK_MD5, checksum: "4ba71b52b96c1ed16b0583698b5a477e")
!87 = !{!88, !91, !92, !93, !95, !96, !137, !392, !422, !423, !424}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !85, file: !86, line: 21, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_atomic_type, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !85, file: !86, line: 22, baseType: !89, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "exc", scope: !85, file: !86, line: 23, baseType: !89, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !85, file: !86, line: 26, baseType: !94, size: 32, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "worker_id", file: !75, line: 6, baseType: !55)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "current_stack_frame", scope: !85, file: !86, line: 31, baseType: !81, size: 64, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "reducer_map", scope: !85, file: !86, line: 34, baseType: !97, size: 64, offset: 320)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "cilkred_map", file: !75, line: 11, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cilkred_map", file: !100, line: 27, size: 256, elements: !101)
!100 = !DIFile(filename: "runtime/cilkred_map.h", directory: "/afs/ece.cmu.edu/project/seth_group/pakha/opencilk/cheetah", checksumkind: CSK_MD5, checksum: "e52a4574017c564fe7646f334aa498be")
!101 = !{!102, !105, !106, !107, !109, !111}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "spa_cap", scope: !99, file: !100, line: 28, baseType: !103, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "hyper_id_t", file: !104, line: 9, baseType: !55)
!104 = !DIFile(filename: "runtime/hyperobject_base.h", directory: "/afs/ece.cmu.edu/project/seth_group/pakha/opencilk/cheetah", checksumkind: CSK_MD5, checksum: "14fc778f8b4d01cd421e525c7fab9a5b")
!105 = !DIDerivedType(tag: DW_TAG_member, name: "num_of_vinfo", scope: !99, file: !100, line: 29, baseType: !103, size: 32, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "num_of_logs", scope: !99, file: !100, line: 30, baseType: !103, size: 32, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "merging", scope: !99, file: !100, line: 32, baseType: !108, size: 8, offset: 96)
!108 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !99, file: !100, line: 33, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "vinfo", scope: !99, file: !100, line: 35, baseType: !112, size: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "ViewInfo", file: !100, line: 21, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "view_info", file: !100, line: 18, size: 128, elements: !115)
!115 = !{!116, !117}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !114, file: !100, line: 19, baseType: !46, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "hyper", scope: !114, file: !100, line: 20, baseType: !118, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "hyperobject_base", file: !104, line: 21, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hyperobject_base", file: !104, line: 13, size: 320, elements: !121)
!121 = !{!122, !127, !132, !133, !134, !136}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "identity_fn", scope: !120, file: !104, line: 14, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__cilk_identity_fn", file: !32, line: 31, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{null, !46}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_fn", scope: !120, file: !104, line: 15, baseType: !128, size: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__cilk_reduce_fn", file: !32, line: 32, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !46, !46}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "view_size", scope: !120, file: !104, line: 16, baseType: !60, size: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "id_num", scope: !120, file: !104, line: 17, baseType: !103, size: 32, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !120, file: !104, line: 18, baseType: !135, size: 32, offset: 224)
!135 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !120, file: !104, line: 19, baseType: !46, size: 64, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !85, file: !86, line: 37, baseType: !138, size: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "global_state", file: !140, line: 48, size: 10752, elements: !141)
!140 = !DIFile(filename: "runtime/global.h", directory: "/afs/ece.cmu.edu/project/seth_group/pakha/opencilk/cheetah", checksumkind: CSK_MD5, checksum: "8b905717cf32668f3048866ca0d22d34")
!141 = !{!142, !151, !152, !161, !163, !228, !231, !233, !252, !265, !285, !286, !292, !293, !295, !297, !298, !300, !304, !331, !353, !354, !355, !356, !357, !358, !360, !361, !362, !364, !365, !366, !367, !368, !371, !374}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !139, file: !140, line: 50, baseType: !143, size: 256)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rts_options", file: !140, line: 37, size: 256, elements: !144)
!144 = !{!145, !146, !147, !148, !149, !150}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "stacksize", scope: !143, file: !140, line: 38, baseType: !60, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nproc", scope: !143, file: !140, line: 39, baseType: !7, size: 32, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "reducer_cap", scope: !143, file: !140, line: 40, baseType: !7, size: 32, offset: 96)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "deqdepth", scope: !143, file: !140, line: 41, baseType: !7, size: 32, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "fiber_pool_cap", scope: !143, file: !140, line: 42, baseType: !7, size: 32, offset: 160)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "force_reduce", scope: !143, file: !140, line: 43, baseType: !7, size: 32, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nworkers", scope: !139, file: !140, line: 52, baseType: !7, size: 32, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "worker_args", scope: !139, file: !140, line: 53, baseType: !153, size: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "worker_args", file: !140, line: 122, size: 128, elements: !155)
!155 = !{!156, !157}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !154, file: !140, line: 123, baseType: !94, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !154, file: !140, line: 124, baseType: !158, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "global_state", file: !160, line: 30, baseType: !139)
!160 = !DIFile(filename: "runtime/cilk-internal.h", directory: "/afs/ece.cmu.edu/project/seth_group/pakha/opencilk/cheetah", checksumkind: CSK_MD5, checksum: "420bf31eba28da901fba1fc7a0e7105a")
!161 = !DIDerivedType(tag: DW_TAG_member, name: "workers", scope: !139, file: !140, line: 54, baseType: !162, size: 64, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "deques", scope: !139, file: !140, line: 56, baseType: !164, size: 64, offset: 448)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReadyDeque", file: !166, line: 19, size: 512, align: 512, elements: !167)
!166 = !DIFile(filename: "runtime/readydeque.h", directory: "/afs/ece.cmu.edu/project/seth_group/pakha/opencilk/cheetah", checksumkind: CSK_MD5, checksum: "3f8bafaff74476d9258f5fab5b547bf6")
!167 = !{!168, !178, !226, !227}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !165, file: !166, line: 20, baseType: !169, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "cilk_mutex", file: !170, line: 5, baseType: !171)
!170 = !DIFile(filename: "runtime/mutex.h", directory: "/afs/ece.cmu.edu/project/seth_group/pakha/opencilk/cheetah", checksumkind: CSK_MD5, checksum: "6f093ec2985aefc87e9edef7d039ba52")
!171 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cilk_mutex", file: !170, line: 20, size: 32, elements: !172)
!172 = !{!173, !175}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !171, file: !170, line: 21, baseType: !174, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !135)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "posix", scope: !171, file: !170, line: 22, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_spinlock_t", file: !177, line: 226, baseType: !174)
!177 = !DIFile(filename: "/usr/include/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "881aaabf43c3dc120f1b90af0857d602")
!178 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !165, file: !166, line: 21, baseType: !179, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "Closure", file: !6, line: 10, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Closure", file: !6, line: 34, size: 2048, align: 512, elements: !182)
!182 = !{!183, !184, !185, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !202, !203, !204, !205, !206, !207, !208, !209, !210, !215, !216, !217, !218, !219, !220, !224, !225}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !181, file: !6, line: 35, baseType: !169, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !181, file: !6, line: 37, baseType: !73, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "fiber", scope: !181, file: !6, line: 39, baseType: !186, size: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "cilk_fiber", file: !188, line: 30, flags: DIFlagFwdDecl)
!188 = !DIFile(filename: "runtime/fiber.h", directory: "/afs/ece.cmu.edu/project/seth_group/pakha/opencilk/cheetah", checksumkind: CSK_MD5, checksum: "657b88f2a7208787b4d71085ee163dec")
!189 = !DIDerivedType(tag: DW_TAG_member, name: "fiber_child", scope: !181, file: !6, line: 40, baseType: !186, size: 64, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ext_fiber", scope: !181, file: !6, line: 42, baseType: !186, size: 64, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ext_fiber_child", scope: !181, file: !6, line: 43, baseType: !186, size: 64, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "owner_ready_deque", scope: !181, file: !6, line: 45, baseType: !94, size: 32, offset: 384)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "mutex_owner", scope: !181, file: !6, line: 46, baseType: !94, size: 32, offset: 416)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !181, file: !6, line: 48, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "has_cilk_callee", scope: !181, file: !6, line: 49, baseType: !108, size: 8, offset: 456)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "lock_wait", scope: !181, file: !6, line: 50, baseType: !108, size: 8, offset: 464)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "simulated_stolen", scope: !181, file: !6, line: 51, baseType: !108, size: 8, offset: 472)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "join_counter", scope: !181, file: !6, line: 52, baseType: !7, size: 32, offset: 480)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "orig_rsp", scope: !181, file: !6, line: 53, baseType: !200, size: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "callee", scope: !181, file: !6, line: 55, baseType: !179, size: 64, offset: 576)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "call_parent", scope: !181, file: !6, line: 57, baseType: !179, size: 64, offset: 640)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "spawn_parent", scope: !181, file: !6, line: 58, baseType: !179, size: 64, offset: 704)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "left_sib", scope: !181, file: !6, line: 60, baseType: !179, size: 64, offset: 768)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "right_sib", scope: !181, file: !6, line: 61, baseType: !179, size: 64, offset: 832)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "right_most_child", scope: !181, file: !6, line: 63, baseType: !179, size: 64, offset: 896)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "next_ready", scope: !181, file: !6, line: 82, baseType: !179, size: 64, offset: 960)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "prev_ready", scope: !181, file: !6, line: 83, baseType: !179, size: 64, offset: 1024)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "right_rmap", scope: !181, file: !6, line: 89, baseType: !211, size: 64, offset: 1088)
!211 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_atomic_type, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "cilkred_map", file: !100, line: 37, baseType: !99)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "child_rmap", scope: !181, file: !6, line: 91, baseType: !211, size: 64, offset: 1152)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "user_rmap", scope: !181, file: !6, line: 93, baseType: !213, size: 64, offset: 1216)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "reraise_cfa", scope: !181, file: !6, line: 101, baseType: !200, size: 64, offset: 1280)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "parent_rsp", scope: !181, file: !6, line: 104, baseType: !200, size: 64, offset: 1344)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "saved_throwing_fiber", scope: !181, file: !6, line: 107, baseType: !186, size: 64, offset: 1408)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "right_exn", scope: !181, file: !6, line: 110, baseType: !221, size: 64, offset: 1472)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "closure_exception", file: !6, line: 25, size: 64, elements: !222)
!222 = !{!223}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "exn", scope: !221, file: !6, line: 26, baseType: !200, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "child_exn", scope: !181, file: !6, line: 112, baseType: !221, size: 64, offset: 1536)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "user_exn", scope: !181, file: !6, line: 114, baseType: !221, size: 64, offset: 1600)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !165, file: !166, line: 21, baseType: !179, size: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "mutex_owner", scope: !165, file: !166, line: 22, baseType: !94, size: 32, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !139, file: !140, line: 57, baseType: !229, size: 64, offset: 512)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !177, line: 60, baseType: !38)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "root_closure", scope: !139, file: !140, line: 58, baseType: !232, size: 64, offset: 576)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "fiber_pool", scope: !139, file: !140, line: 60, baseType: !234, size: 512, align: 512, offset: 1024)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cilk_fiber_pool", file: !188, line: 22, size: 512, elements: !235)
!235 = !{!236, !237, !238, !239, !240, !242, !244, !245, !246}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !234, file: !188, line: 23, baseType: !169, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "mutex_owner", scope: !234, file: !188, line: 24, baseType: !94, size: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !234, file: !188, line: 25, baseType: !135, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !234, file: !188, line: 26, baseType: !60, size: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !234, file: !188, line: 27, baseType: !241, size: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "fibers", scope: !234, file: !188, line: 30, baseType: !243, size: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !234, file: !188, line: 31, baseType: !7, size: 32, offset: 320)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !234, file: !188, line: 32, baseType: !7, size: 32, offset: 352)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !234, file: !188, line: 33, baseType: !247, size: 96, offset: 384)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiber_pool_stats", file: !188, line: 16, size: 96, elements: !248)
!248 = !{!249, !250, !251}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "in_use", scope: !247, file: !188, line: 17, baseType: !135, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "max_in_use", scope: !247, file: !188, line: 18, baseType: !135, size: 32, offset: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "max_free", scope: !247, file: !188, line: 19, baseType: !7, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "im_pool", scope: !139, file: !140, line: 61, baseType: !253, size: 448, align: 512, offset: 1536)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "global_im_pool", file: !254, line: 15, size: 448, elements: !255)
!254 = !DIFile(filename: "runtime/internal-malloc-impl.h", directory: "/afs/ece.cmu.edu/project/seth_group/pakha/opencilk/cheetah", checksumkind: CSK_MD5, checksum: "e2a95149ed128d780185dac25d65a812")
!255 = !{!256, !257, !258, !260, !261, !262, !263, !264}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "mem_begin", scope: !253, file: !254, line: 16, baseType: !200, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !253, file: !254, line: 17, baseType: !200, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "mem_list", scope: !253, file: !254, line: 18, baseType: !259, size: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "mem_list_index", scope: !253, file: !254, line: 19, baseType: !7, size: 32, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "mem_list_size", scope: !253, file: !254, line: 20, baseType: !7, size: 32, offset: 224)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "num_global_malloc", scope: !253, file: !254, line: 21, baseType: !60, size: 64, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !253, file: !254, line: 22, baseType: !60, size: 64, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "wasted", scope: !253, file: !254, line: 23, baseType: !60, size: 64, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "im_desc", scope: !139, file: !140, line: 62, baseType: !266, size: 2112, align: 512, offset: 2048)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cilk_im_desc", file: !254, line: 39, size: 2112, elements: !267)
!267 = !{!268, !280, !281}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !266, file: !254, line: 40, baseType: !269, size: 1792)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 1792, elements: !278)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "im_bucket", file: !254, line: 26, size: 256, elements: !271)
!271 = !{!272, !273, !274, !275, !276, !277}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "free_list", scope: !270, file: !254, line: 27, baseType: !46, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "free_list_size", scope: !270, file: !254, line: 28, baseType: !7, size: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "free_list_limit", scope: !270, file: !254, line: 29, baseType: !7, size: 32, offset: 96)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !270, file: !254, line: 33, baseType: !135, size: 32, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "max_allocated", scope: !270, file: !254, line: 34, baseType: !135, size: 32, offset: 160)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "wasted", scope: !270, file: !254, line: 35, baseType: !43, size: 64, offset: 192)
!278 = !{!279}
!279 = !DISubrange(count: 7)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !266, file: !254, line: 41, baseType: !43, size: 64, offset: 1792)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "num_malloc", scope: !266, file: !254, line: 42, baseType: !282, size: 256, offset: 1856)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 256, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 4)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "im_lock", scope: !139, file: !140, line: 63, baseType: !169, size: 32, offset: 4160)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "boss_ctx", scope: !139, file: !140, line: 67, baseType: !287, size: 320, align: 512, offset: 4608)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmpbuf", file: !288, line: 9, baseType: !289)
!288 = !DIFile(filename: "runtime/jmpbuf.h", directory: "/afs/ece.cmu.edu/project/seth_group/pakha/opencilk/cheetah", checksumkind: CSK_MD5, checksum: "81b7824f925c5233ec9008023b37113e")
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 320, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 5)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "orig_rsp", scope: !139, file: !140, line: 68, baseType: !46, size: 64, offset: 4928)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "workers_started", scope: !139, file: !140, line: 69, baseType: !294, size: 8, offset: 4992)
!294 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !108)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "start_root_worker", scope: !139, file: !140, line: 73, baseType: !296, size: 32, align: 512, offset: 5120)
!296 = !DIDerivedType(tag: DW_TAG_atomic_type, baseType: !55)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "cilkified_futex", scope: !139, file: !140, line: 78, baseType: !296, size: 32, offset: 5152)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "exiting_worker", scope: !139, file: !140, line: 79, baseType: !299, size: 32, offset: 5184)
!299 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !94)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "cilkified", scope: !139, file: !140, line: 80, baseType: !301, size: 8, offset: 5216)
!301 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_bool", file: !16, line: 85, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_atomic_type, baseType: !108)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "start_root_worker_lock", scope: !139, file: !140, line: 82, baseType: !305, size: 320, offset: 5248)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !177, line: 128, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !177, line: 90, size: 320, elements: !307)
!307 = !{!308, !326, !330}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !306, file: !177, line: 125, baseType: !309, size: 320)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !177, line: 92, size: 320, elements: !310)
!310 = !{!311, !312, !313, !314, !315, !316, !318, !319}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !309, file: !177, line: 94, baseType: !135, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !309, file: !177, line: 95, baseType: !7, size: 32, offset: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !309, file: !177, line: 96, baseType: !135, size: 32, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !309, file: !177, line: 98, baseType: !7, size: 32, offset: 96)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !309, file: !177, line: 102, baseType: !135, size: 32, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !309, file: !177, line: 104, baseType: !317, size: 16, offset: 160)
!317 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !309, file: !177, line: 105, baseType: !317, size: 16, offset: 176)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !309, file: !177, line: 106, baseType: !320, size: 128, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !177, line: 79, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !177, line: 75, size: 128, elements: !322)
!322 = !{!323, !325}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !321, file: !177, line: 77, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !321, file: !177, line: 78, baseType: !324, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !306, file: !177, line: 126, baseType: !327, size: 320)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 320, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 40)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !306, file: !177, line: 127, baseType: !43, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "start_root_worker_cond_var", scope: !139, file: !140, line: 83, baseType: !332, size: 384, offset: 5568)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !177, line: 154, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !177, line: 139, size: 384, elements: !334)
!334 = !{!335, !347, !351}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !333, file: !177, line: 151, baseType: !336, size: 384)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !333, file: !177, line: 141, size: 384, elements: !337)
!337 = !{!338, !339, !340, !342, !343, !344, !345, !346}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !336, file: !177, line: 143, baseType: !135, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__futex", scope: !336, file: !177, line: 144, baseType: !7, size: 32, offset: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__total_seq", scope: !336, file: !177, line: 145, baseType: !341, size: 64, offset: 64)
!341 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "__wakeup_seq", scope: !336, file: !177, line: 146, baseType: !341, size: 64, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "__woken_seq", scope: !336, file: !177, line: 147, baseType: !341, size: 64, offset: 192)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__mutex", scope: !336, file: !177, line: 148, baseType: !46, size: 64, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__nwaiters", scope: !336, file: !177, line: 149, baseType: !7, size: 32, offset: 320)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__broadcast_seq", scope: !336, file: !177, line: 150, baseType: !7, size: 32, offset: 352)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !333, file: !177, line: 152, baseType: !348, size: 384)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 384, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 48)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !333, file: !177, line: 153, baseType: !352, size: 64)
!352 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "cilkified_lock", scope: !139, file: !140, line: 84, baseType: !305, size: 320, offset: 5952)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "cilkified_cond_var", scope: !139, file: !140, line: 85, baseType: !332, size: 384, offset: 6272)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !139, file: !140, line: 89, baseType: !301, size: 8, align: 512, offset: 6656)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "terminate", scope: !139, file: !140, line: 90, baseType: !294, size: 8, offset: 6664)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "root_closure_initialized", scope: !139, file: !140, line: 91, baseType: !294, size: 8, offset: 6672)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "index_to_worker", scope: !139, file: !140, line: 93, baseType: !359, size: 64, align: 512, offset: 7168)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "worker_to_index", scope: !139, file: !140, line: 94, baseType: !359, size: 64, offset: 7232)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "index_lock", scope: !139, file: !140, line: 95, baseType: !169, size: 32, offset: 7296)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "disengaged_sentinel", scope: !139, file: !140, line: 101, baseType: !363, size: 64, align: 512, offset: 7680)
!363 = !DIDerivedType(tag: DW_TAG_atomic_type, baseType: !36)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "disengaged_thieves_futex", scope: !139, file: !140, line: 106, baseType: !296, size: 32, align: 512, offset: 8192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "disengaged_lock", scope: !139, file: !140, line: 108, baseType: !305, size: 320, offset: 8256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "disengaged_cond_var", scope: !139, file: !140, line: 109, baseType: !332, size: 384, offset: 8576)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "print_lock", scope: !139, file: !140, line: 111, baseType: !169, size: 32, offset: 8960)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "id_manager", scope: !139, file: !140, line: 113, baseType: !369, size: 64, offset: 9024)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "reducer_id_manager", file: !140, line: 22, flags: DIFlagFwdDecl)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "hyper_table", scope: !139, file: !140, line: 115, baseType: !372, size: 64, offset: 9088)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "hyper_table", file: !140, line: 115, flags: DIFlagFwdDecl)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !139, file: !140, line: 117, baseType: !375, size: 1472, offset: 9152)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "global_sched_stats", file: !376, line: 34, size: 1472, elements: !377)
!376 = !DIFile(filename: "runtime/sched_stats.h", directory: "/afs/ece.cmu.edu/project/seth_group/pakha/opencilk/cheetah", checksumkind: CSK_MD5, checksum: "6d543503527fddaf1cfacc07dcc8ba43")
!377 = !{!378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !390}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "boss_waiting", scope: !375, file: !376, line: 36, baseType: !36, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "boss_wait_count", scope: !375, file: !376, line: 37, baseType: !36, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "boss_begin", scope: !375, file: !376, line: 38, baseType: !36, size: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "exit_time", scope: !375, file: !376, line: 39, baseType: !36, size: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "boss_end", scope: !375, file: !376, line: 40, baseType: !36, size: 64, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "steals", scope: !375, file: !376, line: 41, baseType: !36, size: 64, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "repos", scope: !375, file: !376, line: 42, baseType: !36, size: 64, offset: 384)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "reeng_rqsts", scope: !375, file: !376, line: 43, baseType: !36, size: 64, offset: 448)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "onesen_rqsts", scope: !375, file: !376, line: 44, baseType: !36, size: 64, offset: 512)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !375, file: !376, line: 45, baseType: !388, size: 448, offset: 576)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 448, elements: !278)
!389 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !375, file: !376, line: 46, baseType: !391, size: 448, offset: 1024)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 448, elements: !278)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !85, file: !86, line: 40, baseType: !393, size: 64, offset: 448)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "local_state", file: !395, line: 10, size: 5376, elements: !396)
!395 = !DIFile(filename: "runtime/local.h", directory: "/afs/ece.cmu.edu/project/seth_group/pakha/opencilk/cheetah", checksumkind: CSK_MD5, checksum: "d4b5de2fa46afee76a320583a6972d8d")
!396 = !{!397, !398, !401, !403, !404, !405, !406, !407, !408, !409, !410, !411}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "shadow_stack", scope: !394, file: !395, line: 11, baseType: !90, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "hyper_table", scope: !394, file: !395, line: 12, baseType: !399, size: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "hyper_table_cache", file: !395, line: 8, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !394, file: !395, line: 14, baseType: !402, size: 16, offset: 128)
!402 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "provably_good_steal", scope: !394, file: !395, line: 15, baseType: !108, size: 8, offset: 144)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "rand_next", scope: !394, file: !395, line: 16, baseType: !7, size: 32, offset: 160)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "wake_val", scope: !394, file: !395, line: 17, baseType: !55, size: 32, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "rts_ctx", scope: !394, file: !395, line: 19, baseType: !287, size: 320, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "fiber_pool", scope: !394, file: !395, line: 20, baseType: !234, size: 512, offset: 576)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "im_desc", scope: !394, file: !395, line: 21, baseType: !266, size: 2112, offset: 1088)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "fiber_to_free", scope: !394, file: !395, line: 22, baseType: !186, size: 64, offset: 3200)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ext_fiber_to_free", scope: !394, file: !395, line: 23, baseType: !186, size: 64, offset: 3264)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !394, file: !395, line: 24, baseType: !412, size: 2048, offset: 3328)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_stats", file: !376, line: 22, size: 2048, elements: !413)
!413 = !{!414, !415, !416, !417, !418, !419, !420, !421}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !412, file: !376, line: 23, baseType: !391, size: 448)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !412, file: !376, line: 24, baseType: !391, size: 448, offset: 448)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !412, file: !376, line: 25, baseType: !391, size: 448, offset: 896)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !412, file: !376, line: 26, baseType: !391, size: 448, offset: 1344)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "steals", scope: !412, file: !376, line: 28, baseType: !36, size: 64, offset: 1792)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "repos", scope: !412, file: !376, line: 29, baseType: !36, size: 64, offset: 1856)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "reeng_rqsts", scope: !412, file: !376, line: 30, baseType: !36, size: 64, offset: 1920)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "onesen_rqsts", scope: !412, file: !376, line: 31, baseType: !36, size: 64, offset: 1984)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !85, file: !86, line: 45, baseType: !46, size: 64, offset: 512)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ext_stack", scope: !85, file: !86, line: 46, baseType: !46, size: 64, offset: 576)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ltq_limit", scope: !85, file: !86, line: 49, baseType: !90, size: 64, offset: 640)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !76, file: !53, line: 42, baseType: !287, size: 320, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !76, file: !53, line: 46, baseType: !46, size: 64, offset: 512)
!427 = !{}
!428 = !DILocation(line: 65, column: 46, scope: !70)
!429 = !DILocalVariable(name: "w", scope: !70, file: !59, line: 66, type: !430)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "__cilkrts_worker", file: !376, line: 7, baseType: !85)
!432 = !DILocation(line: 66, column: 23, scope: !70)
!433 = !DILocation(line: 54, column: 12, scope: !434, inlinedAt: !437)
!434 = distinct !DISubprogram(name: "__cilkrts_get_tls_worker", scope: !160, file: !160, line: 53, type: !435, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !427)
!435 = !DISubroutineType(types: !436)
!436 = !{!430}
!437 = distinct !DILocation(line: 66, column: 27, scope: !70)
!438 = !DILocation(line: 67, column: 5, scope: !70)
!439 = !DILocation(line: 67, column: 9, scope: !70)
!440 = !DILocation(line: 67, column: 15, scope: !70)
!441 = !DILocation(line: 68, column: 17, scope: !442)
!442 = distinct !DILexicalBlock(scope: !70, file: !59, line: 68, column: 9)
!443 = !DILocation(line: 68, column: 14, scope: !442)
!444 = !DILocation(line: 68, column: 9, scope: !70)
!445 = !DILocation(line: 69, column: 17, scope: !446)
!446 = distinct !DILexicalBlock(scope: !442, file: !59, line: 68, column: 20)
!447 = !DILocalVariable(name: "sf", arg: 1, scope: !448, file: !59, line: 33, type: !73)
!448 = distinct !DISubprogram(name: "cilkify", scope: !59, file: !59, line: 33, type: !71, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !427)
!449 = !DILocation(line: 33, column: 32, scope: !448, inlinedAt: !450)
!450 = distinct !DILocation(line: 69, column: 9, scope: !446)
!451 = !DILocation(line: 36, column: 26, scope: !452, inlinedAt: !450)
!452 = distinct !DILexicalBlock(scope: !448, file: !59, line: 36, column: 9)
!453 = !DILocation(line: 36, column: 30, scope: !452, inlinedAt: !450)
!454 = !DILocation(line: 36, column: 9, scope: !452, inlinedAt: !450)
!455 = !DILocation(line: 36, column: 35, scope: !452, inlinedAt: !450)
!456 = !DILocation(line: 36, column: 9, scope: !448, inlinedAt: !450)
!457 = !DILocation(line: 37, column: 35, scope: !458, inlinedAt: !450)
!458 = distinct !DILexicalBlock(scope: !452, file: !59, line: 36, column: 41)
!459 = !DILocalVariable(name: "sf", arg: 1, scope: !460, file: !188, line: 43, type: !73)
!460 = distinct !DISubprogram(name: "sysdep_save_fp_ctrl_state", scope: !188, file: !188, line: 43, type: !71, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !427)
!461 = !DILocation(line: 43, column: 50, scope: !460, inlinedAt: !462)
!462 = distinct !DILocation(line: 37, column: 9, scope: !458, inlinedAt: !450)
!463 = !DILocation(line: 38, column: 50, scope: !458, inlinedAt: !450)
!464 = !DILocation(line: 38, column: 9, scope: !458, inlinedAt: !450)
!465 = !DILocation(line: 39, column: 5, scope: !458, inlinedAt: !450)
!466 = !DILocation(line: 40, column: 9, scope: !467, inlinedAt: !450)
!467 = distinct !DILexicalBlock(scope: !452, file: !59, line: 39, column: 12)
!468 = !DILocation(line: 54, column: 12, scope: !434, inlinedAt: !469)
!469 = distinct !DILocation(line: 70, column: 13, scope: !446)
!470 = !DILocation(line: 70, column: 11, scope: !446)
!471 = !DILocation(line: 71, column: 5, scope: !446)
!472 = !DILocation(line: 72, column: 5, scope: !70)
!473 = !DILocation(line: 74, column: 5, scope: !70)
!474 = !DILocation(line: 74, column: 9, scope: !70)
!475 = !DILocation(line: 74, column: 15, scope: !70)
!476 = !DILocation(line: 75, column: 23, scope: !70)
!477 = !DILocation(line: 75, column: 26, scope: !70)
!478 = !DILocation(line: 75, column: 5, scope: !70)
!479 = !DILocation(line: 75, column: 9, scope: !70)
!480 = !DILocation(line: 75, column: 21, scope: !70)
